This is the output for the terraform plan

 # module.vdr["vdr1"].module.citrix.citrix_machine_catalog.wrkgpu-machine-catalog will be created
  + resource "citrix_machine_catalog" "wrkgpu-machine-catalog" {
      + allocation_type          = "Static"
      + description              = ""
      + id                       = (known after apply)
      + minimum_functional_level = "L7_34"
      + name                     = "mc-wrkgpu"
      + provisioning_scheme      = {
          + azure_machine_config           = {
              + azure_master_image = {
                  + master_image   = (known after apply)
                  + resource_group = "rg-itn-tecp-001-automation"
                }
              + license_type       = "Windows_Client"
              + machine_profile    = {
                  + machine_profile_resource_group = "rg-itn-tecp-001-automation"
                  + machine_profile_vm_name        = "vmw-itn-tecp-00001-wrkgpu"
                }
              + master_image_note  = ""
              + service_offering   = "Standard_NV18ads_A10_v5"
              + storage_type       = "Premium_LRS"
              + use_managed_disks  = true
              + vda_resource_group = "rg-itn-tecp-001-vdr"
            }
          + hypervisor                     = (known after apply)
          + hypervisor_resource_pool       = (known after apply)
          + identity_type                  = "ActiveDirectory"
          + machine_account_creation_rules = {
              + naming_scheme      = "wrkgpu-##-vdr1"
              + naming_scheme_type = "Numeric"
            }
          + machine_domain_identity        = {
              + domain                   = "advdr01.eni.intranet"
              + domain_ou                = "OU=wrkgpu,OU=Citrix-vdr,DC=advdr01,DC=eni,DC=intranet"
              + service_account          = "acnsupport"
              + service_account_password = (sensitive value)
            }
          + network_mapping                = [
              + {
                  + network        = "sbn-itn-tecp-vdi-vdr1"
                  + network_device = "0"
                },
            ]
          + number_of_total_machines       = 1
        }
      + provisioning_type        = "MCS"
      + scopes                   = []
      + session_support          = "SingleSession"
      + zone                     = (known after apply)
    }